{
    "original_resume": "Skills\nCertifications\nPublicationsSummary\nCarl is a startup founder, AI engineer, and data automation specialist who\ndrives transformation through data, AI automation, and workflow\noptimization for efficiency. He bridges technology and business to deliver\nscalable solutions for success, empowering no-code creatives through his\ncompany, Craft The Future. With expertise in IT training, cloud computing,\nand full-stack development, Carl excels at simplifying complex technologies\nto create impact-driven innovation.\nExperience\nVolunteeringSQL, Power BI, Tableau, Looker Studio,\nSharepoint CMS, Microsoft ExcelData Analysis & Visualization\nPower Automate, OpenAI API, Claude,\nChatbot DevelopmentAutomation & AI Implementation\nPython, SQL, Javascript, React, Power\nApps, HTMLSoftware Development &\nIntegration\nA 4-month accelerator & mentoring\ninitiative devoted to cultivating the\nnext generation of leaders in\nTechnology in both technical &\nmarket-facing roles.\n 1871 Tech Leaders Certificate\n1871 Innovation Labs\nDecember 2024\nhttps://1871.com/tech-leaders/\nHow To Be A NoCode Creative\nAmazon Publishing\nDecember 2024\nhttps://tinyurl.com/5aphwny4Consulted with business leaders to design AI-powered process\noptimizations, improving workflow efficiency and reducing errors by\n60%.\nLed a data-driven workflow redesign, integrating AI metadata\ntagging to enhance content management strategies.i.c.stars\nBusiness Analyst - InternJanuary 2025 – Present\nMilwaukee, WI\nLed a cross-functional team in building an AI-driven nutrition\nplatform, integrating business strategy with AI automation to\nimprove engagement by 35%.\nWorked closely with stakeholders to implement personalized\nrecommendation systems, aligning technology with user needs and\nbusiness goals.Food FiXR\nDirector of AI & Business AutomationOctober 2024 - Present\nMilwaukee\nDesigned and led workshops on AI, automation, and workflow\nefficiency, helping 100+ individuals improve operational\nperformance.Craft The Future\nStartup FounderMay 2019 - Present\nLed strategic messaging and PR, increasing ETHChicago’s audience\nengagement by 40% and securing 10+ sponsor(including 1871\nInnovation Labs) partnerships and 5 media features.ETHChicago\nDirector of CommunicationsJune 2023 - Sept 2024Aaron \"Carl\" Lewis\n0xgmcarl@gmail.comhttps://www.linkedin.com/in/gmcarl",
    "job_description": "Apply for this job\n\nJob Description\nAccenture Flex offers you the flexibility of local fixed-duration project-based work powered by Accenture, a leading global professional services company. Accenture is consistently recognized on FORTUNE's 100 Best Companies to Work For and Diversity Inc's Top 50 Companies For Diversity lists.\n\nAs an Accenture Flex employee, you will apply your skills and experience to help drive business transformation for leading organizations and communities. In addition to delivering innovative solutions for Accenture's clients, you will work with a highly skilled, diverse network of people across Accenture businesses who are using the latest emerging technologies to address today's biggest business challenges.\n\nYou will receive competitive rewards and access to benefits programs and world-class learning resources. Accenture Flex employees work in their local metro area onsite at the project, significantly reducing and/or eliminating the demands to travel.\n\nJob Description\n\nAs a Technical Business Analyst, you will be responsible for analyzing an organization and designing its processes and systems, assessing the business model and its integration with technology.\n\nAssess the current state, identify customer requirements, and define the future state and/or business solution.\n\nResearch, gather, and synthesize information.\n\ncollaborate and manage the team to perform. Responsible for team decisions.\n\nEngage with multiple teams and contribute on key decisions.\n\nProvide solutions to problems for their immediate team and across multiple teams.\n\nAdvanced proficiency in Business Process Design is required.\n\nDevelop innovative business process designs to enhance efficiency and effectiveness.\n\nCollaborate with cross-functional teams to streamline processes and improve business outcomes.\n\nConduct in-depth business process analysis to identify areas for improvement and optimization.\n\nUtilize Oracle SQL expertise to extract and analyze data for process enhancement.\n\nLead the implementation of business model strategies to drive organizational growth.\n\n*This is a hybrid role; candidate must be located in and able to work 3 days/week onsite in either Jersey City, NJ or Charlotte, NC.\n\n\nQualification\nBasic Qualifications:\n\nMinimum of 5 years of experience as Technical Business Analyst\n\nMinimum of 5 years of experience in Oracle SQL / PSSQL\n\nHS Diploma or GED\n\nPreferred Qualifications:\n\nGood Communication Skills\n\nAbility to lead teams\n\nBachelors or Associates Degree\n\nCompensation at Accenture varies depending on a wide array of factors, which may include but are not limited to the specific office location, role, skill set, and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, District of Columbia, Illinois, Maryland, Minnesota, New York or Washington\n\nWe accept applications on an on-going basis and there is no fixed deadline to apply.\n\nInformation on benefits is here.\n\nRole Location                   Hourly Range\n\nCalifornia                          $41.34 to $51.34\n\nColorado                           $41.34 to $51.34                         \n\nDistrict of Columbia        $41.34 to $51.34       \n\nIllinois                                $41.34 to $51.34                               \n\nMinnesota                        $41.34 to $51.34                           \n\nMaryland                          $41.34 to $51.34                             \n\nNew York                          $41.34 to $51.34                             \n\nWashington                      $41.34 to $51.34                       \n\n\nLocations\nMorristown, NJ\n\nCharlotte, NC\n\nNew York City, NY\n\n\nAdditional Information\nRequesting an Accommodation\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs such as for a disability or religious observance, please call us toll free at 1 (877) 889-9009 or send us an email or speak with your recruiter.\n\n \n\nEqual Employment Opportunity Statement\n\nWe believe that no one should be discriminated against because of their differences. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Our rich diversity makes us more innovative, more competitive, and more creative, which helps us better serve our clients and our communities.\n\nFor details, view a copy of the Accenture Equal Opportunity Statement\n\nAccenture is an EEO and Affirmative Action Employer of Veterans/Individuals with Disabilities.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\n \n\nOther Employment Statements\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. Further, at Accenture a criminal conviction history is not an absolute bar to employment. \n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\nCalifornia requires additional notifications for applicants and employees. If you are a California resident, live in or plan to work from Los Angeles County upon being hired for this position, please click here for additional important information.\n\nPlease read Accenture’s Recruiting and Hiring Statement for more information on how we process your data during the Recruiting and Hiring process.\n\n\nAbout Accenture\nWe work with one shared purpose: to deliver on the promise of technology and human ingenuity. Every day, more than 775,000 of us help our stakeholders continuously reinvent. Together, we drive positive change and deliver value to our clients, partners, shareholders, communities, and each other.\n\nWe believe that delivering value requires innovation, and innovation thrives in an inclusive and diverse environment. We actively foster a workplace free from bias, where everyone feels a sense of belonging and is respected and empowered to do their best work.\n\nAt Accenture, we see well-being holistically, supporting our people’s physical, mental, and financial health. We also provide opportunities to keep skills relevant through certifications, learning, and diverse work experiences. We’re proud to be consistently recognized as one of the World’s Best Workplaces™.",
    "tailored_resume": "Carl Lewis\nEmail: 0xgmcarl@gmail.com | LinkedIn: https://www.linkedin.com/in/gmcarl\n\nSummary\nTechnical Business Analyst and AI engineer with demonstrated expertise in data automation, business process design, and software development. Proven track record in driving business transformation through innovative solutions and strategic leadership. Excels at simplifying complex technologies to create impact-driven innovation.\n\nSkills\n- Data Analysis & Visualization\n- Automation & AI Implementation\n- Software Development & Integration\n- Business Process Design\n- Leadership\n- Oracle SQL / PSSQL (Currently acquiring)\n\nExperience\nBusiness Analyst - Intern\ni.c.stars | Milwaukee, WI | January 2025 – Present\n- Consulted with business leaders to design AI-powered process optimizations, improving workflow efficiency and reducing errors by 60%.\n- Led a data-driven workflow redesign, integrating AI metadata tagging to enhance content management strategies.\n\nDirector of AI & Business Automation\nFood FiXR | Milwaukee, WI | October 2024 - Present\n- Led a cross-functional team in building an AI-driven nutrition platform, integrating business strategy with AI automation to improve engagement by 35%.\n- Worked closely with stakeholders to implement personalized recommendation systems, aligning technology with user needs and business goals.\n\nStartup Founder\nCraft The Future | May 2019 - Present\n- Designed and led workshops on AI, automation, and workflow efficiency, helping 100+ individuals improve operational performance.\n\nEducation\n1871 Tech Leaders Certificate\n1871 Innovation Labs | December 2024\n- A 4-month accelerator & mentoring initiative devoted to cultivating the next generation of leaders in technology in both technical & market-facing roles.\n\nPublication\nHow To Be A NoCode Creative\nAmazon Publishing | December 2024\n\nLanguages\n- Python\n- Javascript\n- React\n- Power Apps\n- HTML\n\nCertifications\n- SQL\n- Power BI\n- Tableau\n- Looker Studio\n- Sharepoint CMS\n- Microsoft Excel\n\nVolunteering\n[Include relevant volunteering experience if applicable]\n\nNote: The role of 'Director of Communications at ETHChicago' has been de-emphasized as it isn't directly relevant to the job application. Other experiences, skills, and qualifications have been prioritized.",
    "analysis": {
        "skills_analysis": {
            "matching_skills": [
                "Data Analysis & Visualization",
                "Automation & AI Implementation",
                "Software Development & Integration",
                "Business Process Design",
                "Leadership"
            ],
            "missing_skills": [
                "Oracle SQL / PSSQL"
            ],
            "match_score": 0.83,
            "suggestions": [
                "Consider gaining experience with Oracle SQL / PSSQL or include any relevant experience you may have omitted from your resume."
            ]
        },
        "experience_analysis": {
            "relevant_experiences": [
                "Business Analyst - Intern at i.c.stars",
                "Director of AI & Business Automation at Food FiXR",
                "Startup Founder at Craft The Future"
            ],
            "irrelevant_experiences": [
                "Director of Communications at ETHChicago"
            ],
            "match_score": 0.75,
            "suggestions": [
                "Consider removing or de-emphasizing the role of 'Director of Communications at ETHChicago' as it isn't directly relevant to the job application."
            ]
        },
        "keyword_analysis": {
            "found_keywords": [
                "Business Analyst",
                "team",
                "efficiency",
                "business model",
                "analysis",
                "business process",
                "design",
                "innovative",
                "business outcomes"
            ],
            "missing_keywords": [
                "Oracle SQL",
                "PSSQL",
                "Technical Business Analyst"
            ],
            "match_score": 0.7,
            "suggestions": [
                "Consider adding the keywords 'Oracle SQL', 'PSSQL' and 'Technical Business Analyst' to your resume in a relevant context."
            ]
        },
        "tailored_resume": {
            "summary": "Carl is an AI engineer and data automation specialist with expertise in business process design and experience as a technical business analyst. He has a proven track record in driving business transformation through innovative solutions and strategic leadership.",
            "skills": [
                "Data Analysis & Visualization",
                "Automation & AI Implementation",
                "Software Development & Integration",
                "Business Process Design",
                "Leadership"
            ],
            "experience": [
                "Business Analyst - Intern at i.c.stars",
                "Director of AI & Business Automation at Food FiXR",
                "Startup Founder at Craft The Future"
            ],
            "formatting_suggestions": [
                "Your resume is well-structured. However, consider adding an 'Education' section if applicable, and make sure your most relevant experiences and skills are listed first."
            ]
        },
        "overall_match_score": 0.76,
        "improvement_suggestions": [
            "Consider gaining experience with Oracle SQL / PSSQL, de-emphasize the role of 'Director of Communications at ETHChicago', and be sure to include the keywords 'Oracle SQL', 'PSSQL' and 'Technical Business Analyst' in your resume. Adding an 'Education' section could also be beneficial if you have relevant qualifications."
        ]
    },
    "timestamp": "20250426_152335",
    "user_name": "Anonymous"
}