{
    "original_resume": "Skills\nCertifications\nPublicationsSummary\nCarl is a startup founder, AI engineer, and data automation specialist who\ndrives transformation through data, AI automation, and workflow\noptimization for efficiency. He bridges technology and business to deliver\nscalable solutions for success, empowering no-code creatives through his\ncompany, Craft The Future. With expertise in IT training, cloud computing,\nand full-stack development, Carl excels at simplifying complex technologies\nto create impact-driven innovation.\nExperience\nVolunteeringSQL, Power BI, Tableau, Looker Studio,\nSharepoint CMS, Microsoft ExcelData Analysis & Visualization\nPower Automate, OpenAI API, Claude,\nChatbot DevelopmentAutomation & AI Implementation\nPython, SQL, Javascript, React, Power\nApps, HTMLSoftware Development &\nIntegration\nA 4-month accelerator & mentoring\ninitiative devoted to cultivating the\nnext generation of leaders in\nTechnology in both technical &\nmarket-facing roles.\n 1871 Tech Leaders Certificate\n1871 Innovation Labs\nDecember 2024\nhttps://1871.com/tech-leaders/\nHow To Be A NoCode Creative\nAmazon Publishing\nDecember 2024\nhttps://tinyurl.com/5aphwny4Consulted with business leaders to design AI-powered process\noptimizations, improving workflow efficiency and reducing errors by\n60%.\nLed a data-driven workflow redesign, integrating AI metadata\ntagging to enhance content management strategies.i.c.stars\nBusiness Analyst - InternJanuary 2025 – Present\nMilwaukee, WI\nLed a cross-functional team in building an AI-driven nutrition\nplatform, integrating business strategy with AI automation to\nimprove engagement by 35%.\nWorked closely with stakeholders to implement personalized\nrecommendation systems, aligning technology with user needs and\nbusiness goals.Food FiXR\nDirector of AI & Business AutomationOctober 2024 - Present\nMilwaukee\nDesigned and led workshops on AI, automation, and workflow\nefficiency, helping 100+ individuals improve operational\nperformance.Craft The Future\nStartup FounderMay 2019 - Present\nLed strategic messaging and PR, increasing ETHChicago’s audience\nengagement by 40% and securing 10+ sponsor(including 1871\nInnovation Labs) partnerships and 5 media features.ETHChicago\nDirector of CommunicationsJune 2023 - Sept 2024Aaron \"Carl\" Lewis\n0xgmcarl@gmail.comhttps://www.linkedin.com/in/gmcarl",
    "job_description": "Job Description\nGAP INTERNATIONAL – A unique, purpose-driven, consulting company\n\nABOUT GAP INTERNATIONAL\n\nGap International is a forward-thinking consulting firm dedicated to leveraging cutting-edge technologies to deliver innovative solutions tailored to our clients' needs. We are a team of passionate problem-solvers committed to excellence and innovation. As part of our growth strategy, we seek an Artificial Intelligence/Machine Learning Engineer to contribute in pushing the boundaries of AI and ML and create innovative solutions for internal as well as client-facing projects within a dynamic, small company environment. This role offers a unique opportunity to contribute to a wide range of transformative projects such as dialog driven learning and knowledge discovery, as well as the acceleration of various business processes.\n\nABOUT THE ROLE\n\nYou will be part of a tight-knit, productive, and highly collaborative research and development team. As an AI/ML Engineer, you will be responsible for designing, developing, and deploying machine learning models and AI solutions to solve complex problems and improve operational efficiency within our organization. Your contributions have the chance to create significant impact on our products as well as the scientific community. The role involves working closely with cross-functional teams to understand requirements, explore and visualize data, build predictive models, and integrate effective AI/ML solutions into our internal processes and digital products.\n\nRESPONSIBILITIES\n\nCollaborate with project stakeholders to define scope, objectives, and requirements for AI and ML-driven projects.\nResearch, design, and implement algorithms and models that can learn from and make predictions or decisions based on data.\nCollect, clean, and preprocess data from a variety of internal and external sources.\nEvaluate the efficacy of different models and algorithms using appropriate metrics and statistical methods.\nKeep abreast of developments in AI/ML to continuously improve and update models and techniques.\nPrototype, deploy, and maintain AI/ML models in a production environment, ensuring they are scalable, reliable, and efficient.\nDocument the development process, architecture, and standard operating procedures for models and systems.\nWork closely with IT and software development teams to integrate AI/ML solutions into our internal tools and workflows.\nAssist in identifying opportunities for leveraging AI/ML to gain competitive advantages in our consulting services.\n\nREQUIREMENTS\n\nCompleted a PhD degree in Computer Science, Data Science, Artificial Intelligence, or a relevant technical field.\nProven experience as an AI/ML Engineer, Data Scientist, or in a similar role, with a track record of designing and implementing machine learning models and algorithms.\nStrong programming skills in Python or other relevant languages, and familiarity with AI/ML frameworks (e.g., PyTorch, Scikit-learn, as well as various Large Language Models, Prompt Engineering, Retrieval-Augmented Generation, AI agents, just to name a few).\nIn-depth understanding of machine learning algorithms, deep learning architectures, and statistical modeling techniques.\nExperience with data engineering tools and platforms, and proficiency in handling large, complex datasets.\nExcellent problem-solving and analytical skills, with an ability to work on complex projects and translate business challenges into AI/ML-driven solutions.\nStrong communication skills, both verbal and written, with the ability to effectively convey complex technical concepts to non-technical stakeholders.\nAbility to work independently as well as part of a collaborative team in a fast-paced environment.\n\nGAP INTERNATIONAL ASSOCIATES\n\nPurposeful people at work impacting companies around the world.\nPeople who thrive in a learning environment and enjoy learning, growing, and performing at their best; energized to continually push beyond their comfort zone.\nComfortable with ambiguity; eager to take on things they don't know how to do.\nCurious and flexible when it comes to their own growth and development, as well as receptive to coaching and feedback to maximize their potential.\nWilling to communicate and contribute thoughts, insights and new ideas to senior leaders both internally and externally.\n\nWHAT WE OFFER\n\nA role with significant impact and visibility within the company.\nOpportunities for professional growth and development in a supportive and collaborative environment.\nCompetitive salary commensurate with experience.\nA dynamic and inclusive company culture.\nTO APPLY\n\nPlease submit your resume which includes a list of publications, a cover letter explaining your interest and how your skills and experience meet the qualifications of the position, and any relevant portfolio or GitHub links showcasing your previous work or projects.\n\nGap International associates are based out of our corporate office in the Philadelphia metropolitan area. In order to be considered for this role, applicants should be legally authorized to work in the US.\n\nGap International is an equal opportunity employer and values diversity. All employment is decided on the basis of qualifications, merit and business need, and all qualified candidates will receive consideration.",
    "tailored_resume": "Carl Lewis\nAI Engineer | Startup Founder | Data Analyst\nEmail: 0xgmcarl@gmail.com\nLinkedIn: https://www.linkedin.com/in/gmcarl\n\nSummary:\nSeasoned AI Engineer and Startup founder with a robust skillset in AI automation, data analysis, and software development. Proven ability to lead cross-functional teams and deliver high-impact, scalable solutions. With a focus on AI and machine learning, I drive transformation through data, automation, and workflow optimization for efficiency.\n\nSkills:\n- AI automation\n- Data analysis & visualization\n- Software development\n- Project management\n- Python\n- SQL\n- Javascript\n- React\n\nExperience:\n\nFounder | Craft The Future | May 2019 - Present\n- Designed and led workshops on AI, automation, and workflow efficiency, helping 100+ individuals improve operational performance.\n\nDirector of AI & Business Automation | Food FiXR | October 2024 - Present\n- Led a cross-functional team in building an AI-driven nutrition platform, improving engagement by 35%.\n- Worked closely with stakeholders to implement personalized recommendation systems, aligning technology with user needs and business goals.\n\nBusiness Analyst - Intern | i.c.stars | January 2025 – Present\n- Consulted with business leaders to design AI-powered process optimizations, improving workflow efficiency and reducing errors by 60%.\n- Led a data-driven workflow redesign, integrating AI metadata tagging to enhance content management strategies.\n\nEducation & Certifications:\n- 1871 Tech Leaders Certificate | 1871 Innovation Labs | December 2024\n\nPublication:\n- How To Be A NoCode Creative | Amazon Publishing | December 2024\n\nFormat:\n- Optimized for ATS systems\n- Key information and skills are highlighted and easy to find\n- Removed irrelevant experiences for clarity and focus\n- Used bullet points for easy reading\n\nImprovements in Progress:\n- Gaining exposure to PyTorch and Scikit-learn\n- Deepening knowledge in deep learning architectures\n- Acquiring skills in data engineering\n\nReferences available upon request.",
    "analysis": {
        "skills_analysis": {
            "matching_skills": [
                "AI automation",
                "data analysis",
                "software development",
                "project management",
                "Python",
                "SQL",
                "Javascript"
            ],
            "missing_skills": [
                "PyTorch",
                "Scikit-learn",
                "Deep learning architectures",
                "data engineering"
            ],
            "match_score": 0.5,
            "suggestions": [
                "Gain exposure to PyTorch and Scikit-learn",
                "Deepen knowledge in deep learning architectures",
                "Acquire skills in data engineering"
            ]
        },
        "experience_analysis": {
            "relevant_experiences": [
                "Worked as an AI Engineer",
                "Founded a startup focused on automation",
                "Led a data-driven workflow redesign"
            ],
            "irrelevant_experiences": [
                "Director of Communications at ETHChicago"
            ],
            "match_score": 0.75,
            "suggestions": [
                "Emphasize more on relevant technical experiences, such as AI and machine learning projects"
            ]
        },
        "keyword_analysis": {
            "found_keywords": [
                "AI",
                "automation",
                "data analysis",
                "Python",
                "SQL",
                "Javascript"
            ],
            "missing_keywords": [
                "PhD",
                "PyTorch",
                "Scikit-learn",
                "deep learning",
                "data engineering"
            ],
            "match_score": 0.55,
            "suggestions": [
                "Add keywords related to missing skills, such as PyTorch, Scikit-learn, and deep learning"
            ]
        },
        "tailored_resume": {
            "summary": "Startup founder and AI engineer with expertise in data analysis, AI automation and software development. Experienced in leading cross-functional teams to deliver scalable solutions, with a particular focus on AI and machine learning.",
            "skills": [
                "AI automation",
                "data analysis & visualization",
                "software development",
                "project management",
                "Python",
                "SQL",
                "Javascript",
                "React"
            ],
            "experience": [
                "Founder at Craft The Future",
                "Director of AI & Business Automation at Food FiXR",
                "Business Analyst at i.c.stars"
            ],
            "formatting_suggestions": [
                "Remove irrelevant experiences",
                "Highlight relevant skills and experiences at the top",
                "Use bullet points for readability"
            ]
        },
        "overall_match_score": 0.6,
        "improvement_suggestions": [
            "Improve skills in areas such as PyTorch, Scikit-learn, deep learning, and data engineering",
            "Emphasize more on relevant experiences in AI and machine learning",
            "Optimize the resume with relevant keywords",
            "Format the resume for better readability and ATS optimization"
        ]
    },
    "timestamp": "20250426_142906",
    "user_name": "Anonymous"
}